In [1]:
import pandas as pd

## Importando os Dados

In [6]:
url = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/base-de-dados/aluguel.csv'

dados = pd.read_csv(url, sep=';')
dados.head() # head and tail should be used to show just some lines

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [7]:
dados.tail(3)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [8]:
type(dados)

pandas.core.frame.DataFrame

## Características Gerais dos Dados

In [10]:
lines, columns = dados.shape

print(f'O DataFrame tem {lines} linhas e {columns} colunas')

O DataFrame tem 32960 linhas e 9 colunas

In [12]:
dados.columns

Index(['Tipo', 'Bairro', 'Quartos', 'Vagas', 'Suites', 'Area', 'Valor',
       'Condominio', 'IPTU'],
      dtype='object')

In [14]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

Como podemos ver, o método `.info()` mostra algumas informações gerais sobre os dados do DataFrame, sendo um sumarizador iniciar da base de dados.

In [25]:
rename_map = {'Tipo': 'Tipo (object)', 'Valor': 'Valor (int64)', 'Quartos': 'Quartos (float64)'}
dados[['Tipo', 'Valor', 'Quartos']].rename(rename_map, axis='columns')

                 Tipo (object)  Valor (int64)  Quartos (float64)
0                    Quitinete         1700.0                  1
1                         Casa         7000.0                  2
2      Conjunto Comercial/Sala         5200.0                  0
3                  Apartamento          800.0                  1
4                  Apartamento          800.0                  1
...                        ...            ...                ...
32955                Quitinete          800.0                  0
32956              Apartamento         1800.0                  3
32957              Apartamento         1400.0                  2
32958              Apartamento         3000.0                  2
32959  Conjunto Comercial/Sala         6500.0                  0

[32960 rows x 3 columns]

Aqui podemos ver como é cada um dos tipos de coluna, `object`, `int64` e `float64`. Ainda temos outros tipos existentes no Pandas, mas esses serão os mais comuns